//1)

// სინქრონული კოდი
// ეს კოდი სრულდება ხაზობრივი თანმიმდევრობით — ყოველი ხაზი ელოდება წინა ხაზის შესრულებას

console.log("1. დაწყება");

function syncTask() {
  console.log("2. სინქრონული დავალება შესრულდა");
}

syncTask();

console.log("3. დასრულდა");

// ასინქრონული კოდი
// ეს კოდი არ აჩერებს პროგრამის მიმდინარეობას — მაგალითად, setTimeout მუშაობს გარკვეული დაყოვნებით

console.log("4. ასინქრონული დავალება დაიწყო");

setTimeout(() => {
  console.log("6. ასინქრონული დავალება შესრულდა (დაყოვნება 2წმ)");
}, 2000);

console.log("5. შემდეგი ხაზი ასინქრონური დავალების მოლოდინის გარეშე");
