# 2) შექმენით სია  და შეიტანეთ  10 სხვადასხვა მონაცემთა ტიპის მნიშვნელობა, შემდეგ 5 მონაცემს  შეუცვალეთ   მნიშვნელობა და შემდეგ დაპრინტეთ მთლიანი სია.

lists = ["1.9 ,  , 9 , False , True , 15 + 10 , - 2 , 5 * 3 , 5 / 1 , 8 / 2"]
lists.insert(-2, "jashi")
print(lists)


# 3) სიაში ელემენტების ჯამი შექმენი სია, რომელიც შეიცავს  რიცხვებს.#შესრულებულია დაწერე კოდი , რომელიც გამოითვლის  ამ სიის ელემენტების ჯამს  და დაბეჭდავს შედეგს.

lists = [1,2,3,4,5,6,7,8,9,10,11]
print(sum(lists))

#4) სიის ყველა ელემენტის გაორმაგება შექმენი სია რიცხვებით.  დაწერე კოდი, რომელიც თითოეული ელემენტის გაორმაგებულ  მნიშვნელობას შეიცავს  ახალ სიაში და დაბეჭდავს მას.
lists = [1,2,3,4,5,6,7,8,9,10]
double =[jashi * 2 for jashi in lists]
print(double)

# 5) სიის ელემენტების გამრავლება შექმენი სია  რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.

lists = [1,2,3,4,5,6,7,8,9,10]
num = 10
print(num * 10)