//სტუდენტისგან შემოტანეთ 3 სხვადასხვა საგნის ქულა, შემდეგ გამოითვალეთ საშუალო ქულა და საშუალო ქულის შესაფერისად გამოტანეთ შეფასება, თუ სტუდენტის ქულა მეტია 90 -  ზე და ნაკლებია 100 - ზე, მაშინ გამოიტანეთ 'A', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 70 - ზე და ნაკლებია 80 - ზე, მაშინ გამოიტანეთ 'B', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 50 - ზე და ნაკლებია 65 - ზე, მაშინ გამოიტანეთ 'C', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 25 - ზე და ნაკლებია 50 - ზე, მაშინ გამოიტანეთ 'D', ხოლო თუ 25 -  ზე ნაკლებია, მაშინ გამოიტანეთ 'წადი ისწავლე და მერე მოდი'

let res = Number(promt('Enter your grade: '));

let resCalculator = (res >= 90 && res <= 100) ? 'A' :
                    (res >= 70 && res <= 800) ? 'B' :
                    (res >= 50 && res <= 65) ? 'C' :
                    (res >= 25 && res <= 50) ? 'D' :
                    (res < 25) ? 'წადი ისწავლე და მერე მოდი' :
                    'არასწორი შედეგი';
