#დავალება: შექმენით ლისტი და შეცვალეთ შიგნით მყოფი მნიშვნელობები შეცვალე, შემდეგ კი დაპრინტეთ განახლებული სია.

list = [1,2,3,4,5]

list[0] = '^'
list[1] = '!'
list[2] = '@'
list[3] = '#'
list[4] = '$'

print(list)



#დავალებვა1: შექმენით სია სადაც ჩაწერთ თამაშების სახელებს, შემდეგ კი ეს სახელები შეცვალეთ პროგრამირების ენებით.

trash = ['Pubg','Fortnite','Brawl Stars']

trash[0] = 'Python'
trash[1] = 'Css'
trash[2] = 'Java script'

print(trash)



#დავალება2: შექმენით ლისტი და შემდეგ ეს ლისტი დაპრინტეთ უკუღმა

food= ['khinkali','mwvadi','khachapuri']

food.reverse()

print(food)



#დაფვალება3: შექმენით ლისტი სადაც ჩაწერთ რიცხვებს 0 დან 20-მდე, და შემდეგ დაპრინტეთ მხოლოდ კენტი რიცხვები.

numbers = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]


