# 2)
# შექმენით 10 მთელი რიცხვების სია, რიცხვები, 1-დან 10-მდე.

# დაჭერით სია, რომ მიიღოთ პირველი 5 ელემენტი და დაბეჭდეთ ისინი.

# დაჭერით სია ბოლო 3 ელემენტის მისაღებად და დაბეჭდეთ ისინი.

# დაჭერით სია, რომ მიიღოთ ყოველი მეორე ელემენტი სიიდან და დაბეჭდეთ იგი.
 

numbers = [1,2,3,4,5,6,7,8,9,10]

print(numbers[0:5])
print(numbers[-3::])
print(numbers[1::2])



# # 3)
#  შექმენით 6 სტრიქონის სია, რომლებიც წარმოადგენენ სხვადასხვა ხილს: ['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი']. 

# 1. შეცვალეთ სია ჭრის გამოყენებით და ამობეჭდეთ შებრუნებული სია. 
# 2. შეცვალეთ შუა ორი ხილი ['კივი', 'ცაცხვი'] სიის ჭრის გამოყენებით და დაბეჭდეთ განახლებული სია.



fruit = ['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი']

fruit.reverse()
print(fruit)
fruit[2] = 'კივი'
fruit[3] = 'ცაცხვი'
print(fruit)
